import cn from 'clsx'

import { Accordion } from '@/components/ui'

import styles from './index.module.scss'

export const HistoryBlock = () => {
  return (
    <section className={styles.section}>
      <div className={styles.container}>
        <h1 className={cn(styles.title, styles._animateItems)}>История</h1>
        <div className={styles.content}>
          <Accordion title='Профсоюзы'>
            <p>
              Профсоюзы – добровольные общественные объединения граждан,
              связанных общими производственными и профессиональными интересами
              по роду их деятельности. Главная функция профсоюзов –
              представительство и защита социально-трудовых интересов и прав
              трудящихся. Профсоюзы играют важную роль в решении спорных
              вопросов, возникающих между государством, работодателем и
              работниками.
            </p>
          </Accordion>
          <Accordion title='Краткая история профсоюзного движения'>
            <p>
              Вплоть до конца ХIХ века в России создание профсоюзов не
              допускалось. В имперский период в стране существовало небольшое
              количество касс взаимопомощи, которые решали некоторые
              материальные проблемы рабочих. Действовали также нелегальные
              рабочие союзы. Первые легальные объединения рабочих – Общества
              взаимного вспомоществования рабочих механического производства в
              Москве и Санкт-Петербурге – были созданы по инициативе главы
              Особого отдела Департамента полиции С.В. Зубатова в 1901-1903
              годах. В 1904 г. по инициативе священника Г. Гапона в
              Санкт-Петербурге было создано «Собрание русских фабрично-заводских
              рабочих». Однако после события 9 января 1905 г., вошедших в
              историю под названием «Кровавое воскресенье», Союз был распущен. В
              ходе первой русской революции 1905-1907 гг. во многих городах были
              созданы рабочие организации. Некоторые из них были легализованы,
              однако затем закрыты. Новый подъем рабочего движения, что в
              частности выразилось в создании профсоюзных объединений, начался в
              1910 г., который продолжался вплоть до 1917 года. Период
              формирования и становления профсоюзных организаций в России
              завершился к лету 1918 года. Первый учредительный съезд
              Всесоюзного центрального совета профессиональных союзов (ВЦСПС),
              объединивших впоследствии все профессиональные организации сначала
              России, затем СССР, состоялся в январе 1918 года. Все годы
              существования советского государства профсоюзы играли важную роль
              в организации производства и быта рабочих и служащих, начиная от в
              ликвидации безработицы и безграмотности, в обеспечении
              продовольствием и топливом рабочих и их семей в первые
              послереволюционные годы и заканчивая целым комплексом социальных
              гарантий и льгот, предоставляемых по линии профсоюзов в
              позднесоветский период. Охват работающего населения советской
              страны имел массовый характер. В СССР не было ни одного
              предприятия или учреждения, где бы не работала профсоюзная
              организация. ВЦСПС владел значительной собственностью, прежде
              всего, это объекты недвижимости (учебные комплексы, гостиницы,
              санатории, детские лагеря, профилактории, административные
              здания); имел собственное печатное издание. Газета «Труд»,
              издаваемая с 1921 г., была не только одной из самых популярных в
              СССР, но и одной из самых многотиражных – к началу 1990-х годов
              тираж издания составлял 21 млн 500 тыс. экземпляров.
            </p>
          </Accordion>
          <Accordion title='Профсоюзы в современной России'>
            <p>
              Процесс демонтажа СССР не мог не затронуть профсоюзное движение.
              23 марта 1990 г. состоялся Учредительный съезд республиканских
              профсоюзов РСФСР, который провозгласил создание Федерации
              независимых профсоюзов России (ФНПР), объединившей большинство
              российских отраслевых и территориальных профсоюзов и
              профобъединений. Когда в 1991 г. всесоюзный орган ВЦСПС был
              распущен, роль его преемника досталась ФНПР. В настоящее время в
              последнюю входит 121 членская организация; ее членами являются
              37,7 млн человек. В 2010 г. было создано еще одно крупное
              профсоюзное объединение – Союз профсоюзов России (СПР). По данным
              на январь 2015 г. в СПР входит 35 членских организаций. В мае 2011
              г. ФНПР вошла с состав созданного по инициативе В.В. Путина
              Общероссийского народного фронта (ОНФ). В России также действует
              множество профсоюзных организаций, не входящих ни в ФНПР, ни в
              СПР. По данным Росстата на январь 2015 г., в России
              зарегистрировано 28 197 профсоюзных организаций.Согласно
              Федеральному закону РФ № 10 от 12 января 1996 г. «О
              профессиональных союзах, их правах и гарантиях деятельности»,
              каждый, достигший возраста 14 лет и осуществляющий трудовую
              (профессиональную) деятельность, имеет право по своему выбору
              создавать профсоюзы для защиты своих интересов, вступать в них,
              заниматься профсоюзной деятельностью и выходить из профсоюзов. Это
              право реализуется свободно, без предварительного разрешения.
              Граждане РФ, проживающие вне ее территории, могут состоять в
              российских профсоюзах. Иностранные граждане и лица без
              гражданства, проживающие на территории России, могут состоять в
              российских профсоюзах, за исключением случаев, установленных
              федеральными законами или международными договорами Российской
              Федерации (Ст. 2).Профсоюзы имеют право создавать свои объединения
              (ассоциации) по отраслевому, территориальному или иному
              учитывающему профессиональную специфику признаку - общероссийские
              объединения (ассоциации) профсоюзов, межрегиональные объединения
              (ассоциации) профсоюзов, территориальные объединения (ассоциации)
              организаций профсоюзов. Профсоюзы, их объединения (ассоциации)
              имеют право сотрудничать с профсоюзами других государств, вступать
              в международные профсоюзные и другие объединения и организации,
              заключать с ними договоры, соглашения (ФЗ № 10 «О профессиональных
              союзах, их правах и гарантиях деятельности», Ст. 2).
            </p>
          </Accordion>
        </div>
      </div>
    </section>
  )
}
