export const employees = [
  {
    imageUrl: '/Glushenkova.jpg',
    fullName: 'Глушенкова Светлана Борисовна',
    position: 'Председатель первичной профсоюзной организации',
    description:
      'Я рада приветствовать Вас на страничке первичной профсоюзной организации работников ГБПОУ КСТ ТО УГСО МГО Общероссийского профсоюза образования. Авторитет первичной профсоюзной организации, ее способность эффективно представлять и защищать интересы работников перед работодателем, да и само право на представительство зависит от количества и активности членов профсоюза в учреждении. Поэтому важнейшей задачей нашей профсоюзной организации является вовлечение работников в профсоюз и активную профсоюзную деятельность. Аргументация в этом случае понятна и проста: ведь только там, где есть Профсоюз, есть эффективный коллективный договор. Профсоюз может гарантировать работнику бесплатную юридическую помощь и защиту его социально-трудовых прав, представлять интересы работников, достойно вести диалог с социальными партнерами на различных уровнях.'
  },
  {
    imageUrl: '/Nefedov.png',
    fullName: 'Алексей Геннадьевич Нефёдов',
    position: 'Председатель совета молодых педагогов',
    description:
      'Залог успешного развития – как системы образования, так и Профсоюза – воспитание перспективной, креативной и профессионально грамотной молодёжи. Совет молодых педагогов первичной профсоюзной организации ГБПОУ КСТ - общественное объединение молодых педагогических работников не достигших возраста 35 лет, членов Профсоюза работников народного образования и науки РФ, созданное в целях поддержки молодых специалистов в образовании, решения их социально-экономических проблем, защиты прав и интересов. Основные цели Совета молодых педагогов ППО ГБПОУ КСТ это – реализация молодёжной профсоюзной политики; создание условий для активного вовлечения молодых педагогов в Профсоюз и их участия в деятельности ППО ГБПОУ КСТ ТО УГСО и МГО Профсоюза работников народного образования и науки РФ; обобщение и распространение среди молодых педагогов передового педагогического опыта; подготовка предложений по усилению защиты социально-трудовых прав и профессиональных интересов молодых педагогов, а также популяризация профессии педагога. Без сомнения, эффективное развитие отрасли образования и её профессионального союза невозможно без организации работы с молодыми педагогами, ведь они – главный источник инициатив, новых идей и преобразований.'
  }
]
