export const statistic = [
  {
    type: 'Защиту',
    info: {
      title: 'Защита',
      description: [
        'Бесплатная юридическая консультация по вопросам приема на работу, переводов и увольнению, рабочего времени и отдыха, охраны труда и др.',
        'Финансовая и юридическая поддержка "Профконсалтинг"'
      ]
    }
  },
  {
    type: 'Гарантии',
    info: {
      title: 'Гарантии',
      description: [
        'Гарантированный режим рабочего времени не более 36 часов в неделю',
        'Гарантированный удлиненный оплачиваемый отпуск работникам дошкольных отделений, работающих с детьми с ОВЗ',
        'Гарантия контрля за соблюдением коллективного договора'
      ]
    }
  },
  {
    type: 'Помощь',
    info: {
      title: 'Помощь',
      description: [
        'Фонд социальной и благотворительной помощи',
        'Кредитный союз учителей приходит на выручку, если предстоят серьезные и неотложные траты'
      ]
    }
  },
  {
    type: 'Дотации',
    info: {
      title: 'Дотации',
      description: [
        'На театральные билеты и концерты',
        'На годовые абонементы в фитнес клубы',
        'На отдых и оздоровление'
      ]
    }
  },
  {
    type: 'Проф. рост',
    info: {
      title: 'Проф. рост',
      description: [
        'Столичная Ассоциация Молодых Педагогов',
        'Курсы повышения квалификации',
        'Круглые столы, мастер классы',
        'Стажировки'
      ]
    }
  },
  {
    type: 'Общение',
    info: {
      title: 'Общение',
      description: [
        'Профсоюзные конкурсы',
        'Eжегодный фестиваль-конкурс "Радуга"',
        'Спортивные мероприятия'
      ]
    }
  },
  {
    type: 'Подарки',
    info: {
      title: 'Подарки',
      description: [
        'Первоклассникам и выпускникам',
        'Новогодние билеты',
        'К 8 марта, к 23 Февраля, ко Дню учителя'
      ]
    }
  }
]
